TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/OpenJourneyPlanner/V1/MultiNaptanTrunk.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <PlanJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.OpenJourneyPlanner.V1">
            <transactionId>testOpenJP</transactionId>
            <language>en-GB</language>
            <request>
                <ModeFilter>
                    <Include>true</Include>
                    <Modes>
                        <TransportMode>
                            <Mode>Rail</Mode>
                        </TransportMode>
                    </Modes>
                </ModeFilter>
                <Depart>false</Depart>
                <Destination>
                    <GivenName>Reading (Any Rail)</GivenName>
                    <Locality>N0071726</Locality>
                    <Stops>
                        <RequestStop>
                            <Coordinate>
                                <Easting>471528</Easting>
                                <Northing>173813</Northing>
                            </Coordinate>
                            <NaPTANID>9100RDNG4AB</NaPTANID>
                            <TimeDate>2014-04-29T10:00:00.0000000+01:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>471528</Easting>
                                <Northing>173813</Northing>
                            </Coordinate>
                            <NaPTANID>9100RDNGSTN</NaPTANID>
                            <TimeDate>2014-04-29T10:00:00.0000000+01:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>470253</Easting>
                                <Northing>173425</Northing>
                            </Coordinate>
                            <NaPTANID>9100REDGWST</NaPTANID>
                            <TimeDate>2014-04-29T10:00:00.0000000+01:00</TimeDate>
                        </RequestStop>                        
                    </Stops>
                    <Type>NaPTAN</Type>
                </Destination>
                <Origin>
                    <GivenName>London (Any Rail)</GivenName>
                    <Locality>N0077631</Locality>
                    <Stops>
                        <RequestStop>
                            <Coordinate>
                                <Easting>531714</Easting>
                                <Northing>180914</Northing>
                            </Coordinate>
                            <NaPTANID>9100BLFR</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>532600</Easting>
                                <Northing>180800</Northing>
                            </Coordinate>
                            <NaPTANID>9100CANONST</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>530284</Easting>
                                <Northing>180418</Northing>
                            </Coordinate>
                            <NaPTANID>9100CHRX</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>531690</Easting>
                                <Northing>181150</Northing>
                            </Coordinate>
                            <NaPTANID>9100CTMSLNK</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>529500</Easting>
                                <Northing>182700</Northing>
                            </Coordinate>
                            <NaPTANID>9100EUSTON</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>533431</Easting>
                                <Northing>180932</Northing>
                            </Coordinate>
                            <NaPTANID>9100FENCHRS</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>530300</Easting>
                                <Northing>183000</Northing>
                            </Coordinate>
                            <NaPTANID>9100KNGX</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>530480</Easting>
                                <Northing>182980</Northing>
                            </Coordinate>
                            <NaPTANID>9100KNSXMCL</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>533176</Easting>
                                <Northing>181643</Northing>
                            </Coordinate>
                            <NaPTANID>9100LIVST</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>533000</Easting>
                                <Northing>180200</Northing>
                            </Coordinate>
                            <NaPTANID>9100LNDNBDC</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>533000</Easting>
                                <Northing>180200</Northing>
                            </Coordinate>
                            <NaPTANID>9100LNDNBDE</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>527500</Easting>
                                <Northing>182000</Northing>
                            </Coordinate>
                            <NaPTANID>9100MARYLBN</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>532600</Easting>
                                <Northing>181700</Northing>
                            </Coordinate>
                            <NaPTANID>9100MRGT</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>532700</Easting>
                                <Northing>182500</Northing>
                            </Coordinate>
                            <NaPTANID>9100OLDST</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>526600</Easting>
                                <Northing>181300</Northing>
                            </Coordinate>
                            <NaPTANID>9100PADTON</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>530000</Easting>
                                <Northing>183150</Northing>
                            </Coordinate>
                            <NaPTANID>9100STPX</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>528900</Easting>
                                <Northing>179000</Northing>
                            </Coordinate>
                            <NaPTANID>9100VICTRIC</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>528900</Easting>
                                <Northing>179000</Northing>
                            </Coordinate>
                            <NaPTANID>9100VICTRIE</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>531200</Easting>
                                <Northing>179800</Northing>
                            </Coordinate>
                            <NaPTANID>9100WATRLMN</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                        <RequestStop>
                            <Coordinate>
                                <Easting>531350</Easting>
                                <Northing>180044</Northing>
                            </Coordinate>
                            <NaPTANID>9100WLOE</NaPTANID>
                            <TimeDate>0001-01-01T00:00:00.0000000-00:00</TimeDate>
                        </RequestStop>
                    </Stops>
                    <Type>NaPTAN</Type>
                </Origin>
                <PublicParameters>
                    <Algorithm>Fastest</Algorithm>
                    <InterchangeSpeed>1</InterchangeSpeed>
                    <IntermediateStops>All</IntermediateStops>
                    <Interval>0001-01-01T02:00:00.0000000-00:00</Interval>
                    <MaxWalkDistance>100</MaxWalkDistance>
                    <RangeType>Interval</RangeType>
                    <TrunkPlan>true</TrunkPlan>
                    <WalkSpeed>80</WalkSpeed>
                </PublicParameters>
            </request>
        </PlanJourney>
    </soap:Body>
</soap:Envelope>